/*
普通写例子在SMS40BL中测试通过，舵机出厂速度单位为0.732rpm
如果使用出厂速度单位是0.0146rpm，则速度改为V=4000，延时公式T=[(P1-P0)/V]*1000+[V/(A*100)]*1000
*/

#include "stm32f4xx.h"
#include "SCServo.h"
#include "usart.h"

void setup(void)
{
	//Uart_Init(115200);
  HAL_Delay(1000);
}

/*void loop(void)
{
  WritePosEx(1, 4095, 4000, 100);//舵机(ID1),以最高速度V=80(50*80步/秒),加速度A=100(100*100步/秒^2),运行至P1=4095
  HAL_Delay(1495);//[(P1-P0)/(50*V)]*1000+[(50*V)/(A*100)]*1000
	
  WritePosEx(1, 0, 4000, 100);//舵机(ID1),以最高速度V=80(50*80步/秒),加速度A=100(100*100步/秒^2),运行至P1=0
  HAL_Delay(1495);//[(P1-P0)/(50*V)]*1000+[(50*V)/(A*100)]*1000
}*/
